0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1;

boundaryField
{
   inletFace
   {
      type fixedValue;
      value  uniform 1;
   }
   inletWall
   {
     type zeroGradient;
   }
   inletsourceFace
   {
      type zeroGradient;
   }
   inletdestinationFace
   {
      type zeroGradient;
   }
   fineMeshWall
   {
      type zeroGradient;
   }
   fineMeshSourceFace 
   {
      type zeroGradient;
   }
   fineMeshdestinationFace
   {
      type zeroGradient;
   }
   fineMeshSymmetryWall
   {
      type symmetryPlane;
   }
   fineMeshOutletLeft
   {
      type fixedValue;
      value uniform 0;
   }
   fineMeshOutletBottom
   {
      type calculated;
      value uniform 0;
   }
}

// ************************************************************************* //
