0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1;

boundaryField
{
   inletFace
   {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 1;
   }
   inletWall
   {
        type            kqRWallFunction;
        value uniform   4.49;
   }
   inletsourceFace
   {
        type            kqRWallFunction;
        value uniform   4.49;
   }
   inletdestinationFace
   {
        type            kqRWallFunction;
        value uniform   4.49;
   }
   fineMeshWall
   {
        type            kqRWallFunction;
        value uniform   4.49;
   }
   fineMeshSourceFace
   {
        type            kqRWallFunction;
        value uniform   4.49;
   }
   fineMeshdestinationFace
   {
        type            kqRWallFunction;
        value uniform   4.49;
   }
   fineMeshSymmetryWall
   {
        type            symmetryPlane;
   }
   fineMeshOutletLeft
   {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
   }
   fineMeshOutletBottom
   {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
   }

}


// ************************************************************************* //
